<!DOCTYPE html>

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
  <link rel="stylesheet" href="style.css" type="text/css" media="screen,print" charset="utf-8">
  <title>Curr&iacute;culum Vitae de Sergio Rodr&iacute;guez Calvo</title>
  <!--[if IE 6]>
    <link rel="stylesheet" href="style_ie6.css" type="text/css" media="screen" charset="utf-8" />
    <![endif]-->
  </head>

  <body>

    <div class="content">
      <div class="wrapper">
        <h1>Sergio Rodr&iacute;guez Calvo</h1>
        <div class="contact">
          <ul>
            <li class="mail"><a href="mailto:sergiorodriguezcalvo@gmail.com" target="_blank">sergiorodriguezcalvo@gmail.com</a></li>
            <li class="github"><a href="https://github.com/serrodcal" target="_blank">github.com/serrodcal</a></li>
          </ul>
        </div><!-- #contact -->
        
		<div class="section">
          <h2>Sobre m&iacute;</h2>
		  <div class="about">
				<p>&nbsp&nbsp&nbsp&nbsp&nbsp&nbspMe describo como una persona con inter&eacute;s por aprender, no s&oacutelo en temas relacionados con la inform&aacute;tica, 
				sino con otras &aacute;reas tales como la historia, la aeron&aacute;utica, las matem&aacute;ticas, la f&iacute;sica, etc. De hecho, 
				durante mis estudios en la Universidad me han levantado especial inter&eacute;s asignaturas relacionadas con la L&oacute;gica, 
				la Inteligencia Artificial, la seguridad en redes y la Arquitectura de Computadores.</p>
				<br />
                <p>&nbsp&nbsp&nbsp&nbsp&nbsp&nbspEn un primer momento mi motivaci&oacute;n para estudiar inform&aacute;tica vino gracias a los primeros pasos en cuanto a 
				programaci&oacute;n, sobre todo en HTML (durante el Bachillerato) y la motivaci&oacute;n que siempre he tenido en cuanto a ordenadores, 
				m&oacute;viles e Internet.</p>
				<br />
				<p>&nbsp&nbsp&nbsp&nbsp&nbsp&nbspActualmente pretendo escapar del concepto de ingeniero inform&aacute;tico como programador y de ese modo centrarme
				m&aacute;s en las tareas propias de un ingeniero, es decir, usar el conocimiento y la t&eacute;cnica para resolver problemas de forma 
				organizada, y no solo dentro de la inform&aacute;tica sino con otras ramas dentro de las ingenier&iacute;as.</p>
				<br />
				<p>&nbsp&nbsp&nbsp&nbsp&nbsp&nbspProfesionalmente busco adquirir experiencia en ramas relacionadas con el desarrollo con el objetivo de lograr un 
				puesto con m&aacute;s responsabilidad en cualquier rama de la ingenier&iacute;a, y poder seguir desarrollando mi ingl&eacute;s.</p>
          </div>
		</div><!-- #section -->
		
        <div class="section">
          <h2>Experiencia Laboral</h2>
          <div class="period">
            <div class="date">Marzo 2010 - Junio 2010</div>
            <div class="description">
              <div class="company">Sefosa Obras y Servicios Ambientales</div>
              <div class="job">Desarrollador</div>
              <div class="job_description">
                Desarrollo de aplicaci&oacute;n para lectura de par&aacute;metros mediante comunicaci&oacute;n con placas de veh&iacute;culos forestales. Para ello, 
				la aplicaci&oacute;n se desarroll&oacute; utilizando la plataforma .Net de Microsoft usando como entorno Visual Studio 2008 para C#, lenguaje que tuve que
				aprender. Dicha tarea, desarrollada haciendo uso de Orientado a Objeto, consist&iacute;a en leer continuamente del puerto Serie (donde se conectaba 
				el hardware) y mediante lectura en los mensajes recibidos y posterior b&uacute;squeda en una base de datos se mostraban par&aacute;metros tales como, 
				presi&oacute;n y temperatura del aceite, velocidad, etc.
              </div>
			  <ul class="technologies">
                <li>C#</li>
              </ul>
            </div>
		  </div>
		  
		  <div class="period">
            <div class="date">2006 - Actualidad</div>
            <div class="description">
              <div class="company">Trabajos Eventuales</div>
			  <div class="job">Mantenimiento inform&aacute;tico en hogares</div>
              <div class="job_description">
                Reparaci&oacuten de equipos inform&aacute;ticos en hogares a familiares y amigos principalmente, desde montaje completo de equipos, hasta sustituciones de
				componentes averiados, formatear equipos y puesta a punto.
              </div>
			  <div class="job">Carpinter&iacute;a y obras</div>
              <div class="job_description">
                He realizado varios trabajos de montaje de cocinas y armarios en el &aacute;mbito de la carpinter&iacute;a con mi padre. Tambi&eacute;n trabajo montando y 
				desmontando la caseta de feria del Club de Pesca San Rafael todos los años en v&iacute;speras de dichas fiestas.
              </div>
            </div>
		  </div>

        </div><!-- #section -->
		
        <div class="section">
		
          <h2>Formaci&oacute;n Acad&eacute;mica</h2>	
			
          <div class="period">
            <div class="date">Septiembre 2010 - Actualidad</div>
            <div class="description">
              <div class="studies">Ingenier&iacute;a Inform&aacute;tica - Ingenier&iacute;a del Software</div>
              <div class="institution">Universidad de Sevilla</div>
			  <div class="job_description">
                Conocimientos sobre algoritmos (b&uacute;squeda en espacio de estados, planificaci&oacute;n, sistemas basados en reglas, redes neuronales, etc), sobre
				arquitecturas de computadores (RISC con MIPS y CISC con IA-32), sobre criptograf&iacute;a y seguridad en redes, modelado y visualizaci&oacute;n gr&aacute;fica con 
				MATLAB (Curvas de B&eacute;zier, etc.), sobre frameworks (JPA, Hibernate, 
				Spring, Maven, Sonar, AppEngine, etc), y sobre principios de diseño. Tambi&eacute;n en el &aacute;mbito de la gesti&oacute;n software: organizaci&oacute;n y gesti&oacute;n de reuniones, 
				Plan de Gesti&oacute;n de Calidad, Gesti&oacute;n de la Configuraci&oacute;n (seg&uacute;n ITIL), Plan de Gesti&oacute;n de riesgos, as&iacute; como en el 
				&aacute;mbito de las adquisiciones en el sector p&uacute;blico.(<b>75% de los cr&eacute;ditos aprobados, nota media actual: 7'16</b>)
              </div>
			  <ul class="projects">
				<li><a href="pitoria.html" target="_blank">Sistema de Gesti&oacute;n de votos en Rep&uacute;blica de Pitoria</a></li>
				<li><a target="_blank">Sistema de Gesti&oacute;n de competiciones de f&uacute;tbol</a></li>
				<li><a target="_blank">Sistema de Gesti&oacute;n de almac&eacute;n de libros</a></li>
				<li><a href="gestionInstituto.html" target="_blank">Sistema de Gesti&oacute;n de centro educativo (a nivel de requisitos)</a></li>
				<li><a target="_blank">Sistema Web de Gesti&oacute;n de empresa de certificaci&oacute;n acad&eacute;mica</a></li>
				<li><a href="inversionSLD.html" target="_blank">Inversi&oacute;n de SLD resoluci&oacute;n con l&oacute;gica de primer orden (Python)</a></li>
			  </ul>
              <ul class="technologies">
                <li>C</li>
				<li>Java</li>
				<li>Ensamblador</li>
				<li>PHP</li>
				<li>CSS</li>
				<li>XHTML</li>
				<li>JavaScript</li>
				<li>Python</li>
				<li>AppEngine</li>
				<li>JPA</li>
				<li>Maven</li>
				<li>jQuery</li>
				<li>Sonar</li>
				<li>Hibernate</li>
				<li>Verilog</li>
				<li>SVN</li>
				<li>SQL</li>
				<li>Git</li>
				<li>XML</li>
				<li>JSON</li>
				<li>Servicios REST</li>
				<li>SSL</li>
				<li>LDAP</li>
				<li>SCRUM</li>
				<li>Metrica V3</li>
				<li>REM</li>
				<li>UML</li>
				<li>MATLAB</li>
				<li>Octave</li>
				<li>MongoDB (NOSQL)</li>
				<li>Xampp</li>
				<li>Apache</li>
				<li>JUnit</li>
				<li>Ensamblador</li>
				<li>DNS</li>
				<li>IP v4/6</li>
				<li>BPMN</li>
				<li>GWT</li>
              </ul>
            </div>
          </div><!-- #period -->
		  
		  <div class="period">
            <div class="date">Septiembre 2007 - Junio 2010</div>
            <div class="description">
              <div class="studies">Ciclo Formativo de Grado Superior en Desarrollo de Aplicaciones Inform&aacute;ticas</div>
              <div class="institution">I.E.S Julio Verne</div>
			  <div class="job_description">
                Desarrollo en Programaci&oacute;n Estructurada con C, posteriormente en Orientado a Objeto con Java y C++ contando con al menos 11 
				horas semanales. Conocimientos de Base de Datos tanto MySQL como Oracle 9 con 13 horas semanales. Administraci&oacute;n de Sistemas 
				Windows y Linux. (Nota expediente: <b>8'4</b>)
              </div>
			  <ul class="projects">
				<li><a href="gimnasio.html" target="_blank">Sistema de Gesti&oacute;n de Gimnasio</a></li>
				<li><a href="PI.html" target="_blank">Sistema de Gesti&oacute;n de reservas de vuelos, trenes y hoteles (Proyecto Integrado)</a></li>
				<li><a target="_blank">Juego en Java basado en "La vida de Conway"</a></li>
			  </ul>
			  <ul class="technologies">
                <li>C</li>
				<li>C++</li>
				<li>Java</li>
				<li>JSP</li>
				<li>XHTML</li>
				<li>CSS</li>
				<li>JavaScript</li>
				<li>Visual Basic</li>
				<li>SQL</li>
				<li>PL/SQL</li>
              </ul>
            </div>
          </div><!-- #period -->
		  
		  
		  <div class="period">
            <div class="date">Septiembre 2005 - Mayo 2007</div>
            <div class="description">
              <div class="studies">Bachillerato Modalidad Sociales</div>
              <div class="institution">I.E.S. Julio Verne</div>
            </div>
          </div><!-- #period -->

        </div><!-- #section -->
		
		<div class="section">
			<h2>Intereses y Aficiones</h2>
			<div class="about">
				<ul>
				<li><strong>M&oacute;viles</strong>: Estos dispositivos, en especial la plataforma Android, me despierta un gran inter&eacute;s hasta el punto
				de pasar gran parte de mi tiempo colaborando en foros (como XDA) y modificando ROMs en smartphones propios, de familiares y amigos. Anteriormente
				dedicaba mi tiempo libre a modificar consolas, llegando a modificar mas de 100 consolas PSP para amigos de modo que pudieran ejecutar copias ISO
				de juegos en sus consolas.</li>
				<br />
				<li><strong>Ordenadores</strong>: Siempre me he interesado en la puesta a punto de los Sistemas Operativos para ordenadores, en especial Windows.
				As&iacute; mismo, con bastante frecuencia ayudo a familiares y amigos en sus problemas con sus ordenadores, realizando tareas de mantenimiento e incluso 
				llegando a montar equipos completos, tanto hardware como software. Todo ello teniendo que aprender por m&iacute; mismo y mediante muchas pruebas
				y consultas en Internet (foros, etc.).</li>
				<br />
				<li><strong>Simulaci&oacute;n</strong>: Me despiertan un gran inter&eacute;s todo tipo de simuladores, sobre todo los relacionados con la simulaci&oacute;n de
				carreras de veh&iacute;culos (F1, Rally, etc. con rFactor), y especialmente los simuladores de vuelo. Este &uacute;ltimo, me llevo a comprar dispositivos de
				juegos, como un  Joystick, para poder usar simuladores como X-Plane 9 y Microsoft Flight Simulator 2004/X y aprender conceptos b&aacute;sicos de pilotaje en simulador
				d&oacute;nde dispongo de un par de videos en Youtube que podr&aacute; encontrar <a href="http://www.youtube.com/watch?v=PjjWdLq9f0Q">aqu&iacute;</a> y 
				<a href="http://www.youtube.com/watch?v=DIxwx8_dC6s">aqu&iacute;</a></li>.
				<br />
				<li><strong>Deportes</strong>: Intento practicar alg&uacute;n deporte todos los d&iacute;as. Especialmente f&uacute;tbol, d&oacute;nde e llegado a competir federado
				en la modalidad F&uacute;tbol 11 hasta 4 años consecutivos en un total de 6 años. As&iacute; como, otras competiciones como liga de invierno y de primavera
				dentro de los juegos deportivos municipales y campeonatos como la Copa CocaCola o torneos universitarios entre escuelas y facultades. Pretendo
				entrenar a diario haciendo ejercicios como pesas, barras y carrera continua (al menos 6 kil&oacute;metros diarios). Tambi&eacute;n he practicado otros 
				deportes, de hecho he probado la mayor parte de ellos llegando a competir en pesca mar&iacute;tima federado y nataci&oacute;n. Creo que la pr&aacute;ctica
				de deportes es fundamental para desarrollar habilidades como pueden ser el trabajo en equipo.</li>
				<br />
				<li><strong>Econom&iacute;a</strong>: Lectura de blogs de econom&iacute;a, as&iacute; como aprendizaje sobre conceptos relacionados con la macro y micro econom&iacute;a,
				sistemas econ&oacute;micos, etc. De hecho, de cara a presentar una solicitud para llevar un bar en una piscina aprovech&eacute; los conocimientos
				aprendidos en Bachillerato, Grado Superior y en la asignatura de Administraci&oacute;n de Empresa en 1º del Grado en Ingenier&iacute;a del Software
				para elaborar una propuesta con un estudio de costes y beneficios utilizando conceptos econ&oacute;micos como el coste marginal, etc. en el verano de 
				2011.</li>
				<br />
				<li><strong>Cocina</strong>: A menudo intento realizar recetas para dieta sin gluten de productos dif&iacute;cil de encontrar en el mercado, como 
				bizcochos, magdalenas, galletas, donuts, etc.</li>
				<br />
				<li><strong>Desarrollo m&oacute;vil</strong>: He realizado aplicaciones simples como por ejemplo una calculadora para la plataforma Android con el 
				fin de conocer los conceptos b&aacute;sicos para desarrollar en dicha plataforma. Tambi&eacute;n he acudido a charlas relativas al desarrollo en Android
				impartidas por la asociaci&oacute;n SUGUS en la ETSII y charlas dentro de las jornadas de Imagin&aacute;tica, tambi&eacute;n en la ETSII.</li>
				</ul>
			</div>
		<div>

        <div class="section_half">
          <h2>Idiomas</h2>
          <div class="language_block">
            <div class="language">Espa&ntilde;ol:</div>
            <div class="level">Nativo.</div>
          </div>
          <div class="language_block">
            <div class="language">Ingl&eacute;s:</div>
            <div class="level">Intermedio.</div>
			<div class="job_description">
                (*)Certificado de curso oficial en escuela internacional EF, Londres. Curso de 3 semanas, nivel intermedio.
				Nivel A2 por Instituto de Idiomas, Universidad de Sevilla.
            </div>
          </div>
		  <div class="language_block">
            <div class="language">Franc&eacute;s: </div>
            <div class="level">B&aacute;sico.</div>
          </div>
        </div><!-- #section_half -->

        <div class="section_half last">
          <h2>Otros</h2>
          <ul>
            <li><strong>Android</strong>: Actualmente intento dedicar mi tiempo libre a aprender a desarrollar en la plataforma m&oacute;vil Android.</li>
			<li><strong>Ingl&eacute;s</strong>: Tambi&eacute;n intento aprender y practicar ingl&eacute;s, gram&aacute;tica, pronunciaci&oacute;n y comprensi&oacute;n oral sobre todo.</li>
          </ul>
        </div><!-- #section_half -->
      </div>
    </div>
  </body>

  </html>
